/*
 * Process.c
 *
 * Created: 12.03.2017 8:20:40
 *  Author: stepan
 */ 
#include "Process.h"

/* -----------------------------------------------------------------------------
*                        Basic pin polling function
* ------------------------------------------------------------------------------
*/

static uint16_t Eeprom_addres_process;

//************************************** Опрос PINF-3 ************************************** PINF
void pull_PINF()
{	
	if (PINF & (1 << 3))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINF-2
	if (PINF & (1 << 2))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINF-1
	if (PINF & (1 << 1))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINF-0
	if (PINF & (1 << 0))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
}

//************************************** Опрос PINE-2 ************************************** PINE
void pull_PINE()
{
	if (PINE & (1 << 2))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINE-3
	if (PINE & (1 << 3))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINE-4
	if (PINE & (1 << 4))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINE-5
	if (PINE & (1 << 5))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINE-6
	if (PINE & (1 << 6))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINE-7
	if (PINE & (1 << 7))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
}

//************************************** Опрос PINB-0 ************************************** PINB
void pull_PINB()
{
	if (PINB & (1 << 0))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINB-1
	if (PINB & (1 << 1))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINB-2
	if (PINB & (1 << 2))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINB-3
	if (PINB & (1 << 3))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINB-4
	if (PINB & (1 << 4))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINB-5
	if (PINB & (1 << 5))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINB-6
	if (PINB & (1 << 6))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINB-7
	if (PINB & (1 << 7))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
}

//************************************** Опрос PIND-0 ************************************** PIND
void pull_PIND()
{
	if (PIND & (1 << 0))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Передача пробела
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = ' ';
	//************************************** Опрос PIND-5
	if (PIND & (1 << 5))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PIND-6
	if (PIND & (1 << 6))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PIND-7
	if (PIND & (1 << 7))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
}

//************************************** Опрос PINC-0 ************************************** PINC
void pull_PINC()
{
	if (PINC & (1 << 0))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINC-1
	if (PINC & (1 << 1))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINC-2
	if (PINC & (1 << 2))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINC-3
	if (PINC & (1 << 3))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINC-4
	if (PINC & (1 << 4))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINC-5
	if (PINC & (1 << 5))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINC-6
	if (PINC & (1 << 6))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINC-7
	if (PINC & (1 << 7))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
}

//************************************** Опрос PINA-7 ************************************** PINA
void pull_PINA()
{
	if (PINA & (1 << 7))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINA-6
	if (PINA & (1 << 6))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINA-5
	if (PINA & (1 << 5))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINA-4
	if (PINA & (1 << 4))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINA-3
	if (PINA & (1 << 3))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINA-2
	if (PINA & (1 << 2))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINA-1
	if (PINA & (1 << 1))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
	//************************************** Опрос PINA-0
	if (PINA & (1 << 0))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
}


/* -----------------------------------------------------------------------------
*                        Pin polling process function
* ------------------------------------------------------------------------------
*/


//**************************************************************************** scan_and_USART_Transmit
void Scan_USART_Transmit()
{	
	BLUE_LED_ON;
			
//*********************************************************************************************** Выставляем 1 на пин 3 порта F
	DDRF |=	1 << 3;
	PORTF |= 1 << 3;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINF-2
	if (PINF & (1 << 2))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
//************************************** Опрос PINF-1
if (PINF & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINF-0
if (PINF & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRF &= ~(1 << 3);			// Убираем 1 с пина
PORTF &= ~(1 << 3);

//*********************************************************************************************** Выставляем 1 на пин 2 порта F 
	DDRF |=	1 << 2;
	PORTF |= 1 << 2;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
//************************************** Опрос PINF-3
	if (PINF & (1 << 3))
	{
		while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '1';
	}
	else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINF-1
if (PINF & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINF-0
if (PINF & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRF &= ~(1 << 2);			// Убираем 1 с пина
PORTF &= ~(1 << 2);
	
//*********************************************************************************************** Выставляем 1 на пин 1 порта F 
	DDRF |=	1 << 1;
	PORTF |= 1 << 1;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
//************************************** Опрос PINF-3
if (PINF & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINF-2
if (PINF & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINF-0
if (PINF & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRF &= ~(1 << 1);			// Убираем 1 с пина
PORTF &= ~(1 << 1);

//*********************************************************************************************** Выставляем 1 на пин 0 порта F 
	DDRF |=	1 << 0;
	PORTF |= 1 << 0;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
//************************************** Опрос PINF-3
if (PINF & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINF-2
if (PINF & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINF-1
if (PINF & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';

pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRF &= ~(1 << 0);			// Убираем 1 с пина
PORTF &= ~(1 << 0);

//*********************************************************************************************** Выставляем 1 на пин 2 порта E 
	DDRE |=	1 << 2;
	PORTE |= 1 << 2;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINE-3
if (PINE & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-4
if (PINE & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-5
if (PINE & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-6
if (PINE & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-7
if (PINE & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRE &= ~(1 << 2);			// Убираем 1 с пина
PORTE &= ~(1 << 2);
//*********************************************************************************************** Выставляем 1 на пин 3 порта E 
	DDRE |=	1 << 3;
	PORTE |= 1 << 3;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
//************************************** Опрос PINE-2
if (PINE & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINE-4
if (PINE & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-5
if (PINE & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-6
if (PINE & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-7
if (PINE & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRE &= ~(1 << 3);			// Убираем 1 с пина
PORTE &= ~(1 << 3);
//*********************************************************************************************** Выставляем 1 на пин 4 порта E 
	DDRE |=	1 << 4;
	PORTE |= 1 << 4;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
//************************************** Опрос PINE-2
if (PINE & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-3
if (PINE & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINE-5
if (PINE & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-6
if (PINE & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-7
if (PINE & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRE &= ~(1 << 4);			// Убираем 1 с пина
PORTE &= ~(1 << 4);
//*********************************************************************************************** Выставляем 1 на пин 5 порта E 
	DDRE |=	1 << 5;
	PORTE |= 1 << 5;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
//************************************** Опрос PINE-2
if (PINE & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-3
if (PINE & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-4
if (PINE & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINE-6
if (PINE & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-7
if (PINE & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRE &= ~(1 << 5);			// Убираем 1 с пина
PORTE &= ~(1 << 5);
//*********************************************************************************************** Выставляем 1 на пин 6 порта E 
	DDRE |=	1 << 6;
	PORTE |= 1 << 6;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
//************************************** Опрос PINE-2
if (PINE & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-3
if (PINE & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-4
if (PINE & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-5
if (PINE & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINE-7
if (PINE & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRE &= ~(1 << 6);			// Убираем 1 с пина
PORTE &= ~(1 << 6);
//*********************************************************************************************** Выставляем 1 на пин 7 порта E 
	DDRE |=	1 << 7;
	PORTE |= 1 << 7;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
//************************************** Опрос PINE-2
if (PINE & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-3
if (PINE & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-4
if (PINE & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-5
if (PINE & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINE-6
if (PINE & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';


pull_PINB();
pull_PIND();
pull_PINC();
pull_PINA();

DDRE &= ~(1 << 7);			// Убираем 1 с пина
PORTE &= ~(1 << 7);
//*********************************************************************************************** Выставляем 1 на пин 0 порта B
	DDRB |=	1 << 0;
	PORTB |= 1 << 0;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINB-1
if (PINB & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-2
if (PINB & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-3
if (PINB & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-4
if (PINB & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-5
if (PINB & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-6
if (PINB & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-7
if (PINB & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PIND();
pull_PINC();
pull_PINA();

DDRB &= ~(1 << 0);			// Убираем 1 с пина
PORTB &= ~(1 << 0);
//*********************************************************************************************** Выставляем 1 на пин 1 порта B
	DDRB |=	1 << 1;
	PORTB |= 1 << 1;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
//************************************** Опрос PINB-0
if (PINB & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINB-2
if (PINB & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-3
if (PINB & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-4
if (PINB & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-5
if (PINB & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-6
if (PINB & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-7
if (PINB & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PIND();
pull_PINC();
pull_PINA();

DDRB &= ~(1 << 1);			// Убираем 1 с пина
PORTB &= ~(1 << 1);
//*********************************************************************************************** Выставляем 1 на пин 2 порта B
	DDRB |=	1 << 2;
	PORTB |= 1 << 2;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
//************************************** Опрос PINB-0
if (PINB & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-1
if (PINB & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINB-3
if (PINB & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-4
if (PINB & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-5
if (PINB & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-6
if (PINB & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-7
if (PINB & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PIND();
pull_PINC();
pull_PINA();

DDRB &= ~(1 << 2);			// Убираем 1 с пина
PORTB &= ~(1 << 2);
//*********************************************************************************************** Выставляем 1 на пин 3 порта B
	DDRB |=	1 << 3;
	PORTB |= 1 << 3;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
//************************************** Опрос PINB-0
if (PINB & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-1
if (PINB & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-2
if (PINB & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINB-4
if (PINB & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-5
if (PINB & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-6
if (PINB & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-7
if (PINB & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PIND();
pull_PINC();
pull_PINA();

DDRB &= ~(1 << 3);			// Убираем 1 с пина
PORTB &= ~(1 << 3);
//*********************************************************************************************** Выставляем 1 на пин 4 порта B
	DDRB |=	1 << 4;
	PORTB |= 1 << 4;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
//************************************** Опрос PINB-0
if (PINB & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-1
if (PINB & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-2
if (PINB & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-3
if (PINB & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINB-5
if (PINB & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-6
if (PINB & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-7
if (PINB & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PIND();
pull_PINC();
pull_PINA();

DDRB &= ~(1 << 4);			// Убираем 1 с пина
PORTB &= ~(1 << 4);
//*********************************************************************************************** Выставляем 1 на пин 5 порта B
	DDRB |=	1 << 5;
	PORTB |= 1 << 5;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
//************************************** Опрос PINB-0
if (PINB & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-1
if (PINB & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-2
if (PINB & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-3
if (PINB & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-4
if (PINB & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINB-6
if (PINB & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-7
if (PINB & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PIND();
pull_PINC();
pull_PINA();

DDRB &= ~(1 << 5);			// Убираем 1 с пина
PORTB &= ~(1 << 5);
//*********************************************************************************************** Выставляем 1 на пин 6 порта B
	DDRB |=	1 << 6;
	PORTB |= 1 << 6;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
//************************************** Опрос PINB-0
if (PINB & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-1
if (PINB & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-2
if (PINB & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-3
if (PINB & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-4
if (PINB & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-5
if (PINB & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINB-7
if (PINB & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


pull_PIND();
pull_PINC();
pull_PINA();

DDRB &= ~(1 << 6);			// Убираем 1 с пина
PORTB &= ~(1 << 6);
//*********************************************************************************************** Выставляем 1 на пин 7 порта B
	DDRB |=	1 << 7;
	PORTB |= 1 << 7;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
//************************************** Опрос PINB-0
if (PINB & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-1
if (PINB & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-2
if (PINB & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-3
if (PINB & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-4
if (PINB & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-5
if (PINB & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINB-6
if (PINB & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';


pull_PIND();
pull_PINC();
pull_PINA();

DDRB &= ~(1 << 7);			// Убираем 1 с пина
PORTB &= ~(1 << 7);
//*********************************************************************************************** Выставляем 1 на пин 0 порта D
	DDRD |=	1 << 0;
	PORTD |= 1 << 0;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Передача пробела
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = ' ';
//************************************** Опрос PIND-5
if (PIND & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PIND-6
if (PIND & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PIND-6
if (PIND & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINC();
pull_PINA();

DDRD &= ~(1 << 0);			// Убираем 1 с пина
PORTD &= ~(1 << 0);
//*********************************************************************************************** Выставляем 1 на пин 5 порта D
	DDRD |=	1 << 5;
	PORTD |= 1 << 5;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
//************************************** Опрос PIND-0
if (PIND & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Передача пробела
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = ' ';
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PIND-6
if (PIND & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PIND-7
if (PIND & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINC();
pull_PINA();

DDRD &= ~(1 << 5);			// Убираем 1 с пина
PORTD &= ~(1 << 5);
//*********************************************************************************************** Выставляем 1 на пин 6 порта D
	DDRD |=	1 << 6;
	PORTD |= 1 << 6;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
//************************************** Опрос PIND-0
if (PIND & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Передача пробела
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = ' ';
//************************************** Опрос PIND-6
if (PIND & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PIND-7
if (PIND & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINC();
pull_PINA();

DDRD &= ~(1 << 6);			// Убираем 1 с пина
PORTD &= ~(1 << 6);
//*********************************************************************************************** Выставляем 1 на пин 7 порта D
	DDRD |=	1 << 7;
	PORTD |= 1 << 7;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
//************************************** Опрос PIND-0
if (PIND & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Передача пробела
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = ' ';
//************************************** Опрос PIND-5
if (PIND & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PIND-6
if (PIND & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';


pull_PINC();
pull_PINA();

DDRD &= ~(1 << 7);			// Убираем 1 с пина
PORTD &= ~(1 << 7);

//*********************************************************************************************** Выставляем 1 на пин 0 порта C
	DDRC |=	1 << 0;
	PORTC |= 1 << 0;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINC-1
if (PINC & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-2
if (PINC & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-3
if (PINC & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-4
if (PINC & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-5
if (PINC & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-6
if (PINC & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-7
if (PINC & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINA();

DDRC &= ~(1 << 0);			// Убираем 1 с пина
PORTC &= ~(1 << 0);
//*********************************************************************************************** Выставляем 1 на пин 1 порта C
	DDRC |=	1 << 1;
	PORTC |= 1 << 1;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
//************************************** Опрос PINC-0
if (PINC & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINC-2
if (PINC & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-3
if (PINC & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-4
if (PINC & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-5
if (PINC & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-6
if (PINC & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-7
if (PINC & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINA();

DDRC &= ~(1 << 1);			// Убираем 1 с пина
PORTC &= ~(1 << 1);
//*********************************************************************************************** Выставляем 1 на пин 2 порта C
	DDRC |=	1 << 2;
	PORTC |= 1 << 2;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
//************************************** Опрос PINC-0
if (PINC & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-1
if (PINC & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINC-3
if (PINC & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-4
if (PINC & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-5
if (PINC & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-6
if (PINC & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-7
if (PINC & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINA();

DDRC &= ~(1 << 2);			// Убираем 1 с пина
PORTC &= ~(1 << 2);
//*********************************************************************************************** Выставляем 1 на пин 3 порта C
	DDRC |=	1 << 3;
	PORTC |= 1 << 3;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
//************************************** Опрос PINC-0
if (PINC & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-1
if (PINC & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-2
if (PINC & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINC-4
if (PINC & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-5
if (PINC & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-6
if (PINC & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-7
if (PINC & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINA();

DDRC &= ~(1 << 3);			// Убираем 1 с пина
PORTC &= ~(1 << 3);
//*********************************************************************************************** Выставляем 1 на пин 4 порта C
	DDRC |=	1 << 4;
	PORTC |= 1 << 4;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
//************************************** Опрос PINC-0
if (PINC & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-1
if (PINC & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-2
if (PINC & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-3
if (PINC & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINC-5
if (PINC & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-6
if (PINC & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-7
if (PINC & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINA();

DDRC &= ~(1 << 4);			// Убираем 1 с пина
PORTC &= ~(1 << 4);
//*********************************************************************************************** Выставляем 1 на пин 5 порта C
	DDRC |=	1 << 5;
	PORTC |= 1 << 5;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
//************************************** Опрос PINC-0
if (PINC & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-1
if (PINC & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-2
if (PINC & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-3
if (PINC & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-4
if (PINC & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINC-6
if (PINC & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-7
if (PINC & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINA();

DDRC &= ~(1 << 5);			// Убираем 1 с пина
PORTC &= ~(1 << 5);
//*********************************************************************************************** Выставляем 1 на пин 6 порта C
	DDRC |=	1 << 6;
	PORTC |= 1 << 6;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
//************************************** Опрос PINC-0
if (PINC & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-1
if (PINC & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-2
if (PINC & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-3
if (PINC & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-4
if (PINC & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-5
if (PINC & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINC-7
if (PINC & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();

pull_PINA();

DDRC &= ~(1 << 6);			// Убираем 1 с пина
PORTC &= ~(1 << 6);
//*********************************************************************************************** Выставляем 1 на пин 7 порта C
	DDRC |=	1 << 7;
	PORTC |= 1 << 7;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
//************************************** Опрос PINC-0
if (PINC & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-1
if (PINC & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-2
if (PINC & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-3
if (PINC & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-4
if (PINC & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-5
if (PINC & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINC-7
if (PINC & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';

pull_PINA();

DDRC &= ~(1 << 7);			// Убираем 1 с пина
PORTC &= ~(1 << 7);
//*********************************************************************************************** Выставляем 1 на пин 7 порта A
	DDRA |=	1 << 7;
	PORTA |= 1 << 7;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINA-6
if (PINA & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-5
if (PINA & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-4
if (PINA & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-3
if (PINA & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-2
if (PINA & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-1
if (PINA & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-0
if (PINA & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();




DDRA &= ~(1 << 7);			// Убираем 1 с пина
PORTA &= ~(1 << 7);
//*********************************************************************************************** Выставляем 1 на пин 6 порта A
	DDRA |=	1 << 6;
	PORTA |= 1 << 6;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
//************************************** Опрос PINA-7
if (PINA & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINA-5
if (PINA & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-4
if (PINA & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-3
if (PINA & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-2
if (PINA & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-1
if (PINA & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-0
if (PINA & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


DDRA &= ~(1 << 6);			// Убираем 1 с пина
PORTA &= ~(1 << 6);
//*********************************************************************************************** Выставляем 1 на пин 5 порта A
	DDRA |=	1 << 5;
	PORTA |= 1 << 5;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
//************************************** Опрос PINA-7
if (PINA & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-6
if (PINA & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINA-4
if (PINA & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-3
if (PINA & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-2
if (PINA & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-1
if (PINA & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-0
if (PINA & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


DDRA &= ~(1 << 5);			// Убираем 1 с пина
PORTA &= ~(1 << 5);
//*********************************************************************************************** Выставляем 1 на пин 4 порта A
	DDRA |=	1 << 4;
	PORTA |= 1 << 4;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
//************************************** Опрос PINA-7
if (PINA & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-6
if (PINA & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-5
if (PINA & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINA-3
if (PINA & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-2
if (PINA & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-1
if (PINA & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-0
if (PINA & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


DDRA &= ~(1 << 4);			// Убираем 1 с пина
PORTA &= ~(1 << 4);
//*********************************************************************************************** Выставляем 1 на пин 3 порта A
	DDRA |=	1 << 3;
	PORTA |= 1 << 3;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
//************************************** Опрос PINA-7
if (PINA & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-6
if (PINA & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-5
if (PINA & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-4
if (PINA & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINA-2
if (PINA & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-1
if (PINA & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-0
if (PINA & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


DDRA &= ~(1 << 3);			// Убираем 1 с пина
PORTA &= ~(1 << 3);

//*********************************************************************************************** Выставляем 1 на пин 2 порта A
	DDRA |=	1 << 2;
	PORTA |= 1 << 2;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
//************************************** Опрос PINA-7
if (PINA & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-6
if (PINA & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-5
if (PINA & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-4
if (PINA & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-3
if (PINA & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINA-1
if (PINA & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-0
if (PINA & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


DDRA &= ~(1 << 2);			// Убираем 1 с пина
PORTA &= ~(1 << 2);
//*********************************************************************************************** Выставляем 1 на пин 1 порта A
	DDRA |=	1 << 1;
	PORTA |= 1 << 1;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
//************************************** Опрос PINA-7
if (PINA & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-6
if (PINA & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-5
if (PINA & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-4
if (PINA & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-3
if (PINA & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-2
if (PINA & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';
//************************************** Опрос PINA-0
if (PINA & (1 << 0))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();


DDRA &= ~(1 << 1);			// Убираем 1 с пина
PORTA &= ~(1 << 1);
//*********************************************************************************************** Выставляем 1 на пин 0 порта A
	DDRA |=	1 << 0;
	PORTA |= 1 << 0;
	_delay_ms(RC_DELAY);
//************************************** Ждём и начинаем опрос
pull_PINF();
pull_PINE();
pull_PINB();
pull_PIND();
pull_PINC();
//************************************** Опрос PINA-7
if (PINA & (1 << 7))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-6
if (PINA & (1 << 6))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-5
if (PINA & (1 << 5))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-4
if (PINA & (1 << 4))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-3
if (PINA & (1 << 3))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-2
if (PINA & (1 << 2))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Опрос PINA-1
if (PINA & (1 << 1))
{
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '1';
}
else USART_Transmit_0();
//************************************** Посылем * при наступлении очереди передачи состояния пина с выставленной 1	
	while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = 'U';


DDRA &= ~(1 << 0);			// Убираем 1 с пина
PORTA &= ~(1 << 0);

			
while ( !( UCSR0A & (1<<UDRE0)) );
		UDR0 = '\n';
		
	BLUE_LED_OFF;
}

void fromEeprom_toLongString()
{    							   
	Eeprom_addres_process = cell_addres;  	               
	uint8_t recive_byte = 0;
	
	for(uint8_t i = Pass; i != 0 ; i--)
	{
		Toogle_blue_LED();
		//******************************************************** Port F
		recive_byte = EEPROM_read(Eeprom_addres_process);
	
		if (recive_byte & (1 << 3)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 2)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 1)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 0)) USART_Transmit_1();
		else USART_Transmit_0();
		Eeprom_addres_process++;
	
		//******************************************************** Port E
		recive_byte = EEPROM_read(Eeprom_addres_process);
	
		if (recive_byte & (1 << 2)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 3)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 4)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 5)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 6)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 7)) USART_Transmit_1();
		else USART_Transmit_0();	
		Eeprom_addres_process++;	   
	
		//******************************************************** Port B
		recive_byte = EEPROM_read(Eeprom_addres_process);
	
		if (recive_byte & (1 << 0)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 1)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 2)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 3)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 4)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 5)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 6)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 7)) USART_Transmit_1();
		else USART_Transmit_0();
		Eeprom_addres_process++;  
	
		//******************************************************** Port D
		recive_byte = EEPROM_read(Eeprom_addres_process); 
	
		if (recive_byte & (1 << 0)) USART_Transmit_1();
		else USART_Transmit_0();
	
		USART_Transmit_space();
	
		if (recive_byte & (1 << 5)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 6)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 7)) USART_Transmit_1();
		else USART_Transmit_0();
		Eeprom_addres_process++;
	
		//******************************************************** Port C
		recive_byte = EEPROM_read(Eeprom_addres_process);

		if (recive_byte & (1 << 0)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 1)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 2)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 3)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 4)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 5)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 6)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 7)) USART_Transmit_1();
		else USART_Transmit_0();
		Eeprom_addres_process++;		           
	
		//******************************************************** Port A
		recive_byte = EEPROM_read(Eeprom_addres_process);

		if (recive_byte & (1 << 7)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 6)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 5)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 4)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 3)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 2)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 1)) USART_Transmit_1();
		else USART_Transmit_0();
		if (recive_byte & (1 << 0)) USART_Transmit_1();
		else USART_Transmit_0();
		Eeprom_addres_process++;	
	}
	while ( !( UCSR0A & (1<<UDRE0)) );
	UDR0 = '\n';
	BLUE_LED_OFF;
}
